app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'hariantideka@gmail.com'
 LIMIT 1
---
    public function attemptLogin()
    {
        $session = session();
        $userModel = new UserModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $userModel->where('email', $email)->first();