app/Controllers/Forum.php

SELECT *
FROM `topics`
ORDER BY `created_at` DESC
---
    public function index()
    {
        helper('textlimit');
        $data['topics'] = $this->topicModel->orderBy('created_at', 'DESC')->findAll();

SELECT *
FROM `topics`
WHERE `topics`.`id` = '27'
---
    public function detail($id)
    {
        $data['topic'] = $this->topicModel->find($id);

INSERT INTO `replies` (`topic_id`, `user_id`, `content`, `attachment`, `created_at`) VALUES ('1', '1', 'luu pikir aja kocakk', '[]', '2025-05-13 00:22:50')
---
    public function reply($topic_id)
    {
        $replyModel = new \App\Models\ReplyModel();

    $files = $this->request->getFiles()['attachments'];
    $fileNames = [];

    if ($files) {
        foreach ($files as $file) {
            if ($file->isValid() && !$file->hasMoved()) {
                $newName = $file->getRandomName();
                $file->move('uploads', $newName);
                $fileNames[] = $newName;
            }
        }
    }

    $this->replyModel->insert([
        'topic_id'   => $topic_id,
        'user_id'    => session()->get('user_id'),
        'content'    => $this->request->getPost('content'),
        'attachment' => json_encode($fileNames), // ← simpan json
        'created_at' => date('Y-m-d H:i:s')
    ]);