app/Controllers/ReportController.php

    public function submit()
    {
        $session = session();

        // Pastikan user login
        if (!$session->get('user_id')) {
            return redirect()->back()->with('error', 'Kamu harus login untuk melaporkan.');
        }

        $type = $this->request->getPost('type'); // 'topic' atau 'reply'
        $contentId = $this->request->getPost('id'); // ID dari topik atau balasan
        $reason = $this->request->getPost('reason');

        $reportModel = new ReportModel();

        $reportModel->insert([
            'reporter_id'   => $session->get('user_id'),
            'reported_type' => $type,
            'reported_id'   => $contentId,
            'reason'        => $reason,
        ]);

        // Kirim notifikasi ke admin
        $notifModel = new NotificationModel();
        $adminId = 1; // Ganti dengan user_id admin sesungguhnya

        $message = "Ada laporan baru untuk {$type} dengan ID {$contentId}.";

        $notifModel->insert([
            'user_id'  => $adminId,
            'message'  => $message,
            'is_read'  => 0,
            'created_at' => date('Y-m-d H:i:s')
        ]);
---
INSERT INTO `reports` (`reporter_id`, `reported_type`, `reported_id`, `reason`) VALUES ('4', 'reply', '17', 'ditunggu yaa')
INSERT INTO `notifications` (`user_id`, `message`, `is_read`, `created_at`) VALUES (1, 'Ada laporan baru untuk reply dengan ID 17.', 0, '2025-05-21 08:01:21')