app/Controllers/UserProfileController.php

    public function edit()
    {
        $userModel = new UserModel();
        $userId = session()->get('user_id');

        $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'