app/Controllers/UserController.php

SELECT *
FROM `users`
WHERE `role` = 'user'
---
    public function index()
    {
        $userModel = new UserModel();
        $data['users'] = $userModel->where('role', 'user')->findAll();