app/Models/ReplyModel.php

SELECT `replies`.*, `users`.`name`
FROM `replies`
JOIN `users` ON `users`.`id` = `replies`.`user_id`
WHERE `topic_id` = '27'
ORDER BY `replies`.`created_at` ASC
---
        public function getRepliesWithUsers($topic_id)
        {
        return $this->select('replies.*, users.name')
                    ->join('users', 'users.id = replies.user_id')
                    ->where('topic_id', $topic_id)
                    ->orderBy('replies.created_at', 'ASC')
                    ->findAll();