app/Models/TopicModel.php

SELECT `topics`.*, `users`.`name` as `username`, COUNT(replies.id) as comment_count
FROM `topics`
JOIN `users` ON `users`.`id` = `topics`.`user_id`
LEFT JOIN `replies` ON `replies`.`topic_id` = `topics`.`id`
WHERE `topics`.`user_id` = '1'
GROUP BY `topics`.`id`
ORDER BY `topics`.`created_at` DESC
---
    public function getPostsWithUsers($userId = null, $keyword = null)
    {
        $builder = $this->db->table('topics');
        $builder->select('topics.*, users.name as username, COUNT(replies.id) as comment_count');
        $builder->join('users', 'users.id = topics.user_id');
        $builder->join('replies', 'replies.topic_id = topics.id', 'left');
        $builder->groupBy('topics.id');
        $builder->orderBy('topics.created_at', 'DESC');

        if ($userId !== null) {
            $builder->where('topics.user_id', $userId);
        }

        if ($keyword) {
            $builder->like('topics.title', $keyword);
        }

        return $builder->get()->getResultArray();

SELECT `category`, COUNT(*) as total
FROM `topics`
GROUP BY `category`
ORDER BY `total` DESC
---
    public function getTopicCountByCategory()
    {
        return $this->select('category, COUNT(*) as total')
                    ->groupBy('category')
                    ->orderBy('total', 'DESC')
                    ->findAll();

SELECT DATE(created_at) as date, COUNT(*) as total
FROM `topics`
GROUP BY DATE(created_at)
ORDER BY DATE(created_at) ASC
---
    public function getTopicCountPerDay()
    {
        return $this->select("DATE(created_at) as date, COUNT(*) as total")
                    ->groupBy("DATE(created_at)")
                    ->orderBy("DATE(created_at)", "ASC")
                    ->findAll();